src/DataProcessors/КалендарьСупергрупп/КалендарьСупергрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КалендарьСупергрупп</name>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/ЗаполнитьКоленоМаршрута/ЗаполнитьКоленоМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаполнитьКоленоМаршрута</name>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКолена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрэкНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/DataProcessors/КалендарьСупергрупп/Forms/РасшифровкаКалендаря/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписки();
	Заголовок=Формат(Параметры.ДатаКалендаря,"ДЛФ=DD");
КонецПроцедуры

Процедура ОбновитьСписки()
		Супергруппы.Параметры.УстановитьЗначениеПараметра("НачалоПериода",НачалоДня(Параметры.ДатаКалендаря));
		Супергруппы.Параметры.УстановитьЗначениеПараметра("КонецПериода",КонецДня(Параметры.ДатаКалендаря));
		Элементы.Супергруппы.Обновить();
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьКоленоМаршрута(Команда)
	структура_Параметров=Новый Структура();
	
	структура_Супергруппа=Новый Структура();
	структура_Супергруппа.Вставить("Супергруппа"		,Элементы.Супергруппы.ТекущиеДанные.СуперГруппа);
	структура_Супергруппа.Вставить("НомерКолена"		,Элементы.Супергруппы.ТекущиеДанные.КоленоМаршрута);
	структура_Параметров.Вставить("УстанавливаемФакт",структура_Супергруппа);
	
	
	ОткрытьФорму("Документ.ЗаполнитьКоленоМаршрута.Форма.ФормаДокументаУстанавливаемФакт",структура_Параметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Форма_ЗаполнитьКоленоМаршрута=ПолучитьФорму("Документ.ЗаполнитьКоленоМаршрута.Форма.ФормаДокументаУстанавливаемФакт",структура_Параметров,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
//	Если Форма_ЗаполнитьКоленоМаршрута<> Неопределено Тогда
//		Форма_ЗаполнитьКоленоМаршрута.Открыть();
//	КонецЕсли;
//	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияСупергруппы(Команда)
	структура_Параметров=Новый Структура();
	
	структура_Супергруппа=Новый Структура();
	структура_Супергруппа.Вставить("Супергруппа"		,Элементы.Супергруппы.ТекущиеДанные.СуперГруппа);
	структура_Супергруппа.Вставить("НомерКолена"		,Элементы.Супергруппы.ТекущиеДанные.КоленоМаршрута);
	структура_Параметров.Вставить("УстанавливаемФакт",структура_Супергруппа);
	
	ОткрытьФорму("Документ.РегистрацияСупперГруппы.Форма.ФормаДокумента",структура_Параметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Форма_ЗаполнитьКоленоМаршрута=ПолучитьФорму("Документ.РегистрацияСупперГруппы.Форма.ФормаДокумента",структура_Параметров,ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно);
//	Если Форма_ЗаполнитьКоленоМаршрута<> Неопределено Тогда
//		Форма_ЗаполнитьКоленоМаршрута.Открыть();
//	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СупергруппыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.Мегаордера.Форма.ФормаМаршрута",Новый Структура("Ключ",Элементы.Супергруппы.ТекущиеДанные.СуперГруппа),ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	фрм=ПолучитьФорму("Справочник.Мегаордера.Форма.ФормаМаршрута",Новый Структура("Ключ",Элементы.Супергруппы.ТекущиеДанные.СуперГруппа));
//	фрм.Открыть() ;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ОбновитьФорму" Тогда	
       Элементы.Супергруппы.Обновить();
	КонецЕсли;

КонецПроцедуры
